micropython/micropython/ports/esp32/network_wlan.c
    if (args[ARG_bssid].u_obj != mp_const_none) {
        p = mp_obj_str_get_data(args[ARG_bssid].u_obj, &len);
        if (len != sizeof(wifi_sta_config.sta.bssid)) {
            mp_raise_ValueError(NULL);
        }
        wifi_sta_config.sta.bssid_set = 1;
        memcpy(wifi_sta_config.sta.bssid, p, sizeof(wifi_sta_config.sta.bssid));
    }

    if (eap_method == WIFI_AUTH_EAP_NONE) {
        // WPA2 or WPA3 PSK
        if (args[ARG_wpa3].u_bool == true) {
            // this will only affect WPA3-personal, not enterprise
            wifi_sta_config.sta.threshold.authmode = WIFI_AUTH_WPA3_PSK;
        }
    } else { 
        // WPA2/3 Enterprise
        // At the moment (using ESP-IDF 5.4), setting WIFI_AUTH_WPA3_ENTERPRISE in eduroam networks will 
        // actually default to WPA2 because suite B compatibility is not implemented
        // The reason is outlined here: https://eduroam.org/eduroam-and-wpa3/
        if (args[ARG_wpa3].u_bool == true) {
            wifi_sta_config.sta.threshold.authmode = WIFI_AUTH_WPA3_ENTERPRISE;
        } else {
            wifi_sta_config.sta.threshold.authmode = WIFI_AUTH_WPA2_WPA3_ENTERPRISE;
        }
    }

    esp_exceptions(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_sta_config));

    if (eap_method == WIFI_AUTH_EAP_PWD || eap_method == WIFI_AUTH_EAP_PEAP || eap_method == WIFI_AUTH_EAP_TTLS) {
        // use username and password
        if (args[ARG_username].u_obj != mp_const_none) {
            p = mp_obj_str_get_data(args[ARG_username].u_obj, &len);
            esp_exceptions(esp_eap_client_set_username((const unsigned char *)p, len));
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("missing config param username"));
        }
        if (args[ARG_password].u_obj != mp_const_none) {
            p = mp_obj_str_get_data(args[ARG_password].u_obj, &len);
            esp_exceptions(esp_eap_client_set_password((const unsigned char *)p, len));
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("missing config param password"));
        }
    }

    if (eap_method == WIFI_AUTH_EAP_PEAP || eap_method == WIFI_AUTH_EAP_TTLS) {
        // additionally use identity and ca_cert
        if (args[ARG_identity].u_obj != mp_const_none) {
            p = mp_obj_str_get_data(args[ARG_identity].u_obj, &len);
            esp_exceptions(esp_eap_client_set_identity((const unsigned char *)p, len));
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("missing config param identity"));
        }
        if (args[ARG_ca_cert].u_obj != mp_const_none) {
            p = mp_obj_str_get_data(args[ARG_ca_cert].u_obj, &len);
            // see comment (1) below.
            esp_exceptions(esp_eap_client_set_ca_cert((const unsigned char *)p, len + 1));
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("missing config param ca_cert"));
        }
    }

    if (eap_method == WIFI_AUTH_EAP_TTLS) {
        // additionally use ttls_phase2_method, defaulting to MSCHAPV2 (and then very similar to EAP-PEAP)
        // tested and verified with all 5 supported phase 2 methods
        if (args[ARG_ttls_phase2_method].u_obj != mp_const_none) {
            int16_t ttls_phase2_method = (int16_t)args[ARG_ttls_phase2_method].u_int;
            if (ttls_phase2_method < ESP_EAP_TTLS_PHASE2_EAP || ttls_phase2_method > ESP_EAP_TTLS_PHASE2_CHAP) {
                mp_raise_ValueError(MP_ERROR_TEXT("unknown config value for ttls_phase2_method"));
            }
            mp_printf(&mp_plat_print, "ttls_phase2_method: \"%d\"\n", ttls_phase2_method);
            esp_exceptions(esp_eap_client_set_ttls_phase2_method(ttls_phase2_method));
        }
    }

    if (eap_method == WIFI_AUTH_EAP_TLS) {
        // UNTESTED!
        // EAP-TLS uses client cert, private key, and (optionally) private key password, and (optionally) ca_cert
        // please note that this release does not implement WIFI_AUTH_WPA3_ENT_192
        // The reason is outlined here: https://eduroam.org/eduroam-and-wpa3/
        size_t client_cert_len = 0;
        const char *client_cert = NULL;
        size_t private_key_len = 0;
        const char *private_key = NULL;
        size_t private_key_password_len = 0;
        const char *private_key_password = NULL;

        mp_printf(&mp_plat_print, "\nPlease note that EAP-TLS is so far UNTESTED and thus EXPERIMENTAL.\nUse at your own risk!\n\n");
        if (args[ARG_client_cert].u_obj != mp_const_none) {
            client_cert = mp_obj_str_get_data(args[ARG_client_cert].u_obj, &client_cert_len);
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("missing config param client_cert"));
        }
        if (args[ARG_private_key].u_obj != mp_const_none) {
            private_key = mp_obj_str_get_data(args[ARG_private_key].u_obj, &private_key_len);
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("missing config param private_key"));
        }
        if (args[ARG_private_key_password].u_obj != mp_const_none) {        // password is optional
            private_key_password = mp_obj_str_get_data(args[ARG_private_key_password].u_obj, &private_key_password_len);
        }
        // disable time check or not
        if (args[ARG_disable_time_check].u_bool == true) {
            esp_exceptions(esp_eap_client_set_disable_time_check(true));
            mp_printf(&mp_plat_print, "disable_time_check:  true\n");
        }

        // (1) the documentation for esp_eap_client_set_certificate_and_key() says,
        // "2. The client_cert, private_key, and private_key_password should be zero-terminated."
        // so we copy 1 byte more to include the null
        // in the esp-idf wifi_enterprise example, the null is appended when converting the cert files to byte arrays
        esp_exceptions(esp_eap_client_set_certificate_and_key(
            (const unsigned char *)client_cert, client_cert_len + 1,
            (const unsigned char *)private_key, private_key_len + 1,
            (const unsigned char *)private_key_password, private_key_password_len + 1)
            );
        // according to the esp-idf wifi_enterprise example, the ca_cert is optional for EAP-TLS
        if (args[ARG_ca_cert].u_obj != mp_const_none) {
            p = mp_obj_str_get_data(args[ARG_ca_cert].u_obj, &len);
            esp_exceptions(esp_eap_client_set_ca_cert((const unsigned char *)p, len + 1));
        }
    }

    esp_exceptions(esp_netif_set_hostname(wlan_sta_obj.netif, mod_network_hostname_data));

